package lecture3.butterfly;

/**
 * Описывает класс, заполняющий двумерный массив по принципу (по фигуре) бабочки
 */
public class Butterfly {
    private int[][] array;
    private int size;

    /**
     * конструктор принимает размерность (в данной задаче рассматривается только
     * квадратная матрица)
     * @param size определяет размерность массива
     */
    Butterfly(int size) {
        this.size = size;
        array = new int[size][size];
    }

    /**
     * Поскольку заполненный массив симметричный и имеет 2 осисимметрии,
     * достаточно проверить на условие заполнения одного фрагмента (1 четверть)
     * и заполнить оставшиеся фрагменты относительно осей симметрии.
     * Данный способ работает как для массивов с чётным числом столбцов и строк,
     * так и для массивов с нечётным числом столбцов и строк.
     * Для неквадратных массивов условия создания массива
     * и проверки внутри цикла необходимо изменить в соответствии
     * с размерностью m * n, где m != n
     * @return filled array
     */
    public int[][] fill() {
        for (int i = 0; i < size; i++) {
            for (int j = 0; j < size; j++) {
                if ((j <= size / 2) && i <= j) {
                    array[i][j] = 1;
                    array[i][size - j - 1] = 1;
                    array[size - i - 1][j] = 1;
                    array[size - i - 1][size - j - 1] = 1;
                }
            }
        }
        return array;
    }
}
